## Plan changes
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 7 to add, 3 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.maintenance_mode will be updated in-place
  ~ resource "aws_cloudfront_distribution" "maintenance_mode" {
        aliases                        = [
            "portal.covid-hcportal.cdssandbox.xyz",
            "register.covid-hcportal.cdssandbox.xyz",
        ]
        arn                            = "arn:aws:cloudfront::595701125956:distribution/E14YO6W3RRJLTO"
        caller_reference               = "terraform-20210212142309211700000001"
        comment                        = "This will host the maintenance mode site for COVID Alert Portal"
        default_root_object            = "en.htm"
        domain_name                    = "d3eygkxp18no4n.cloudfront.net"
        enabled                        = true
        etag                           = "E1IZ7GEGCTCX3G"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "E14YO6W3RRJLTO"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = false
        last_modified_time             = "2021-07-16 22:51:42.826 +0000 UTC"
      ~ price_class                    = "PriceClass_All" -> "PriceClass_100"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {}
        tags_all                       = {}
        trusted_key_groups             = [
            {
                enabled = false
                items   = []
            },
        ]
        trusted_signers                = [
            {
                enabled = false
                items   = []
            },
        ]
        wait_for_deployment            = true
        web_acl_id                     = "arn:aws:wafv2:us-east-1:595701125956:global/webacl/maintenance_page/b5d0e980-e61a-45f1-a8c8-0a57c76c68f2"

        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 403
            response_code         = 200
            response_page_path    = "/en.htm"
        }

        default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = true
            default_ttl            = 3600
            max_ttl                = 86400
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "MaintenanceModeHTML"
            trusted_key_groups     = []
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = []
                query_string            = false
                query_string_cache_keys = []

                cookies {
                    forward           = "none"
                    whitelisted_names = []
                }
            }
        }

        origin {
            connection_attempts = 3
            connection_timeout  = 10
            domain_name         = "staging-covid-portal-maintenance-mode.s3.ca-central-1.amazonaws.com"
            origin_id           = "MaintenanceModeHTML"

            s3_origin_config {
                origin_access_identity = "origin-access-identity/cloudfront/E38T6VSUPZG3A9"
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

        viewer_certificate {
            acm_certificate_arn            = "arn:aws:acm:us-east-1:595701125956:certificate/f2952690-398d-4591-8415-7e4417f66d56"
            cloudfront_default_certificate = false
            minimum_protocol_version       = "TLSv1.2_2021"
            ssl_support_method             = "sni-only"
        }
    }

  # aws_cloudfront_distribution.qrcode will be created
  + resource "aws_cloudfront_distribution" "qrcode" {
      + aliases                        = [
          + "register.covid-hcportal.cdssandbox.xyz",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true
      + web_acl_id                     = (known after apply)

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + compress               = true
          + default_ttl            = 0
          + max_ttl                = 0
          + min_ttl                = 0
          + target_origin_id       = "qrcode"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Referer",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
          + prefix          = "cloudfront"
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 604800
          + max_ttl                = 604800
          + min_ttl                = 604800
          + path_pattern           = "/static/*"
          + target_origin_id       = "qrcode"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Referer",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "qrcode-1495691432.ca-central-1.elb.amazonaws.com"
          + origin_id           = "qrcode"

          + custom_header {
              + name  = "covidqrcode"
              + value = "i95Jnz0NbGCRkqzYY6sSv76v"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = [
                  + "CA",
                  + "US",
                ]
              + restriction_type = "whitelist"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:595701125956:certificate/f2952690-398d-4591-8415-7e4417f66d56"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs_qrcode_cdn will be created
  + resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs_qrcode_cdn" {
      + arn            = (known after apply)
      + destination    = "s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-qrcode-cdn"
      + tags_all       = (known after apply)
      + version_id     = (known after apply)

      + s3_configuration {
          + bucket_arn         = "arn:aws:s3:::staging-qrcode-terraform-waf-logs"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "UNCOMPRESSED"
          + role_arn           = "arn:aws:iam::595701125956:role/firehose_waf_logs"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_route53_record.qrcode will be updated in-place
  ~ resource "aws_route53_record" "qrcode" {
        fqdn           = "register.tf.covid-hcportal.cdssandbox.xyz"
        id             = "Z04010123IJK3Z6J7TE8H_register.tf.covid-hcportal.cdssandbox.xyz_A_main"
        name           = "register.tf.covid-hcportal.cdssandbox.xyz"
        records        = []
        set_identifier = "main"
        ttl            = 0
        type           = "A"
        zone_id        = "Z04010123IJK3Z6J7TE8H"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
      - alias {
          - evaluate_target_health = true -> null
          - name                   = "qrcode-1495691432.ca-central-1.elb.amazonaws.com" -> null
          - zone_id                = "ZQSVJUPU6J1EY" -> null
        }

        failover_routing_policy {
            type = "PRIMARY"
        }
    }

  # aws_s3_bucket.cloudfront_logs will be created
  + resource "aws_s3_bucket" "cloudfront_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "covid-portal-staging-cloudfront-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + grant {
          + id          = "c4c1ede66af53448b93c283ce9448c4ba468c9432aa01d700d3878632f77d2d0"
          + permissions = [
              + "FULL_CONTROL",
            ]
          + type        = "CanonicalUser"
        }

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 90
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.cloudfront_logs will be created
  + resource "aws_s3_bucket_public_access_block" "cloudfront_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_shield_protection.cloudfront_qrcode_distribution will be created
  + resource "aws_shield_protection" "cloudfront_qrcode_distribution" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "qrcode_cloudfront_covidportal"
      + resource_arn = (known after apply)
      + tags_all     = (known after apply)
    }

  # aws_wafv2_web_acl.qrcode_acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "qrcode_acl" {
        arn        = "arn:aws:wafv2:ca-central-1:595701125956:regional/webacl/qrcode/90ed9118-ca41-437c-862b-a8d6cb10a584"
        capacity   = 1140
        id         = "90ed9118-ca41-437c-862b-a8d6cb10a584"
        lock_token = "982b6e27-ad00-4102-9880-06d67cc171ad"
        name       = "qrcode"
        scope      = "REGIONAL"
        tags       = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all   = {
            "CostCentre" = "CovidPortal_Staging"
        }

      ~ default_action {
          - allow {
            }

          + block {
            }
        }

      + rule {
          + name     = "CloudFrontCustomHeader"
          + priority = 201

          + action {
              + allow {
                }
            }

          + statement {

              + byte_match_statement {
                  + positional_constraint = "EXACTLY"
                  + search_string         = "i95Jnz0NbGCRkqzYY6sSv76v"

                  + field_to_match {

                      + single_header {
                          + name = "covidqrcode"
                        }
                    }

                  + text_transformation {
                      + priority = 1
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "CloudFrontCustomHeader"
              + sampled_requests_enabled   = false
            }
        }
      - rule {
          - name     = "CanadaOnlyGeoRestriction" -> null
          - priority = 5 -> null

          - action {

              - block {
                  - custom_response {
                      - response_code = 403 -> null

                      - response_header {
                          - name  = "waf-block" -> null
                          - value = "CanadaOnlyGeoRestriction" -> null
                        }
                    }
                }
            }

          - statement {

              - not_statement {
                  - statement {

                      - geo_match_statement {
                          - country_codes = [
                              - "CA",
                            ] -> null
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "CanadaOnlyGeoRestriction" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "PostRequestLimit" -> null
          - priority = 102 -> null

          - action {

              - block {
                }
            }

          - statement {

              - rate_based_statement {
                  - aggregate_key_type = "IP" -> null
                  - limit              = 100 -> null

                  - scope_down_statement {

                      - byte_match_statement {
                          - positional_constraint = "EXACTLY" -> null
                          - search_string         = "post" -> null

                          - field_to_match {

                              - method {}
                            }

                          - text_transformation {
                              - priority = 1 -> null
                              - type     = "LOWERCASE" -> null
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "PostRequestRateLimit" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 1 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRuleSet" -> null
          - priority = 2 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesCommonRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 3 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 4 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }

        visibility_config {
            cloudwatch_metrics_enabled = true
            metric_name                = "covid_portal_global_rule"
            sampled_requests_enabled   = false
        }
    }

  # aws_wafv2_web_acl.qrcode_cdn_acl will be created
  + resource "aws_wafv2_web_acl" "qrcode_cdn_acl" {
      + arn        = (known after apply)
      + capacity   = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "qrcode_cdn"
      + scope      = "CLOUDFRONT"
      + tags       = {
          + "CostCentre" = "CovidPortal_Staging"
        }
      + tags_all   = {
          + "CostCentre" = "CovidPortal_Staging"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "CanadaOnlyGeoRestriction"
          + priority = 5

          + action {

              + block {
                  + custom_response {
                      + response_code = 403

                      + response_header {
                          + name  = "waf-block"
                          + value = "CanadaOnlyGeoRestriction"
                        }
                    }
                }
            }

          + statement {

              + not_statement {
                  + statement {

                      + geo_match_statement {
                          + country_codes = [
                              + "CA",
                            ]
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "CanadaOnlyGeoRestriction"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "PostRequestLimit"
          + priority = 102

          + action {

              + block {
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 100

                  + scope_down_statement {

                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "post"

                          + field_to_match {

                              + method {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "PostRequestRateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 2

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 3

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 4

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "covid_portal_global_rule"
          + sampled_requests_enabled   = false
        }
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_qrcode_cdn will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs_qrcode_cdn" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = (known after apply)
    }

Plan: 7 to add, 3 to change, 0 to destroy.

Changes to Outputs:
    ecs_cluster                  = {
        arn                                = "arn:aws:ecs:ca-central-1:595701125956:cluster/covid-portal_staging"
        capacity_providers                 = [
            "FARGATE",
        ]
        configuration                      = []
        default_capacity_provider_strategy = [
            {
                base              = 2
                capacity_provider = "FARGATE"
                weight            = 1
            },
        ]
        id                                 = "arn:aws:ecs:ca-central-1:595701125956:cluster/covid-portal_staging"
        name                               = "covid-portal_staging"
        setting                            = [
            {
                name  = "containerInsights"
                value = "enabled"
            },
        ]
        tags                               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all                           = {
            "CostCentre" = "CovidPortal_Staging"
        }
    }
    security_group_egress        = {
        arn                    = "arn:aws:ec2:ca-central-1:595701125956:security-group/sg-006789af77a3fbdcb"
        description            = "Egress - CovidShield External Services"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = "Security group rule for Portal New Relic egress"
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = "Security group rule for Portal email egress"
                from_port        = 587
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 587
            },
        ]
        id                     = "sg-006789af77a3fbdcb"
        ingress                = []
        name                   = "egress-anywhere"
        name_prefix            = ""
        owner_id               = "595701125956"
        revoke_rules_on_delete = false
        tags                   = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        timeouts               = null
        vpc_id                 = "vpc-0e71ff594dff0ef9d"
    }
    security_group_load_balancer = {
        arn                    = "arn:aws:ec2:ca-central-1:595701125956:security-group/sg-0ddadcce9ea825a8e"
        description            = "Ingress - covidportal Load Balancer"
        egress                 = [
            {
                cidr_blocks      = [
                    "172.16.0.0/16",
                ]
                description      = ""
                from_port        = 8000
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 8000
            },
        ]
        id                     = "sg-0ddadcce9ea825a8e"
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 80
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 80
            },
        ]
        name                   = "covidportal-load-balancer"
        name_prefix            = ""
        owner_id               = "595701125956"
        revoke_rules_on_delete = false
        tags                   = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        timeouts               = null
        vpc_id                 = "vpc-0e71ff594dff0ef9d"
    }

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>